{
  "forms":{
    "config": {
      "fields": {
        "behavior_payment_refused": {
          "label": "Action après un paiement refusé",
          "help": "Définit le comportement du module PayGreen en cas de paiement refusé.",
          "values": {
            "yes": "Annulation de la commande",
            "no": "Redirection sur la page de paiement"
          }
        },
        "visibility": {
          "label": "Visibilité du module",
          "help": "Permet à l'administrateur de tester le module avant de l'activer pour ses clients.",
          "values": {
            "yes": "Visible par les clients",
            "no": "Visible uniquement par l'administrateur"
          }
        },
        "behavior_transmit_refund": {
          "label": "Synchroniser les remboursements",
          "help": "Si vous activez cette option, alors dès que vous effecturez un remboursement depuis le back-office de votre boutique, une notification sera automatiquement envoyée au serveur PayGreen afin de procéder au remboursement de la transaction."
        },
        "behavior_transmit_delivering": {
          "label": "Synchroniser les confirmations de livraison",
          "help": "Si vous activez cette option, alors dès qu'une commande payable à la livraison sera marquée comme 'terminée', une notification sera automatiquement envoyée au serveur PayGreen afin de valider le paiement."
        },
        "behavior_payment_insite": {
          "label": "Interface de paiement",
          "help": "Pour activer l'interface de paiement in site, le module In Site doit être activé via votre back-office PayGreen. Par ailleurs, l'URL de votre e-commerce doit être en HTTPS (SSL activé), sans quoi votre bouton de paiement sera désactivé.",
          "values": {
            "external": "Page de paiement déportée",
            "insite": "Interface de paiement in site"
          }
        },
        "insite_payment_overlay": {
          "label": "Overlay paiement insite",
          "help": "En activant cette option, un overlay sera affiché derrière l'iframe afin d'éviter que les clients n'interrompent le process de paiement avant son aboutissement. Ils pourront toujours utiliser le bouton 'Annuler mon paiement' pour revenir à l'étape précèdente."
        },
        "behavior_display_footer": {
          "label": "Afficher le logo de sécurité PayGreen",
          "help": "Si cette option est activée, le logo Paiement sécurisé par PayGreen sera affiché en bas de votre site."
        },
        "display_footer_color": {
          "label": "Couleur du logo de sécurité PayGreen",
          "values": {
            "white": "Blanc",
            "green": "Vert",
            "black": "Noir"
          }
        },
        "regenerate_cart_on_cancelled_payment": {
          "label": "Régénérer le panier à l'annulation d'un paiement",
          "help": "Si cette option est activée et qu'un client annule son paiement, son panier sera régénéré."
        },
        "regenerate_cart_on_refused_payment": {
          "label": "Régénérer le panier après un paiement refusé",
          "help": "Si cette option est activée et qu'un client voit son paiement être refusé, son panier sera régénéré."
        }
      }
    }
  }
}